WarrickJiang/linux-yocto-4.1/drivers/staging/rtl8723be/core/rtw_recv.c
	}


_func_exit_;
	return ret;

}


int mp_recv_frame(_adapter *padapter, union recv_frame *rframe)
{
	int ret = _SUCCESS;
	struct rx_pkt_attrib *pattrib = &rframe->u.hdr.attrib;
	struct recv_priv *precvpriv = &padapter->recvpriv;
	_queue *pfree_recv_queue = &padapter->recvpriv.free_recv_queue;
#ifdef CONFIG_MP_INCLUDED
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	struct mp_priv *pmppriv = &padapter->mppriv;
#endif //CONFIG_MP_INCLUDED
	u8 type;
	u8 *ptr = rframe->u.hdr.rx_data;
	u8 *psa, *pda, *pbssid;
	struct sta_info *psta = NULL;
	DBG_COUNTER(padapter->rx_logs.core_rx_pre);

	if ( (check_fwstate(pmlmepriv, _FW_LINKED) == _TRUE) )//&&(padapter->mppriv.check_mp_pkt == 0))
	{
		if (pattrib->crc_err == 1){
			padapter->mppriv.rx_crcerrpktcount++;
		}
		else{
			if(_SUCCESS == validate_mp_recv_frame(padapter, rframe))
				padapter->mppriv.rx_pktcount++;
			else
				padapter->mppriv.rx_pktcount_filter_out++;
		}

		if(pmppriv->rx_bindicatePkt == _FALSE)
		{
			//RT_TRACE(_module_rtl871x_recv_c_, _drv_alert_, ("MP - Not in loopback mode , drop pkt \n"));
			ret = _FAIL;
			rtw_free_recvframe(rframe, pfree_recv_queue);//free this recv_frame
			goto exit;
		}
		else
		{
			type =	GetFrameType(ptr);
			pattrib->to_fr_ds = get_tofr_ds(ptr);
			pattrib->frag_num = GetFragNum(ptr);
			pattrib->seq_num = GetSequence(ptr);
			pattrib->pw_save = GetPwrMgt(ptr);
			pattrib->mfrag = GetMFrag(ptr);
			pattrib->mdata = GetMData(ptr);
			pattrib->privacy = GetPrivacy(ptr);
			pattrib->order = GetOrder(ptr);

			if(type ==WIFI_DATA_TYPE)
			{
				pda = get_da(ptr);
				psa = get_sa(ptr);
				pbssid = get_hdr_bssid(ptr);

				_rtw_memcpy(pattrib->dst, pda, ETH_ALEN);
				_rtw_memcpy(pattrib->src, psa, ETH_ALEN);
				_rtw_memcpy(pattrib->bssid, pbssid, ETH_ALEN);

			switch(pattrib->to_fr_ds)
			{
			case 0:
				_rtw_memcpy(pattrib->ra, pda, ETH_ALEN);
				_rtw_memcpy(pattrib->ta, psa, ETH_ALEN);
				ret = sta2sta_data_frame(padapter, rframe, &psta);
				break;

			case 1:

				_rtw_memcpy(pattrib->ra, pda, ETH_ALEN);
				_rtw_memcpy(pattrib->ta, pbssid, ETH_ALEN);
				ret = ap2sta_data_frame(padapter, rframe, &psta);

				break;

			case 2:
				_rtw_memcpy(pattrib->ra, pbssid, ETH_ALEN);
				_rtw_memcpy(pattrib->ta, psa, ETH_ALEN);
				ret = sta2ap_data_frame(padapter, rframe, &psta);
				break;

			case 3:
				_rtw_memcpy(pattrib->ra, GetAddr1Ptr(ptr), ETH_ALEN);
				_rtw_memcpy(pattrib->ta, GetAddr2Ptr(ptr), ETH_ALEN);
				ret =_FAIL;
				RT_TRACE(_module_rtl871x_recv_c_,_drv_err_,(" case 3\n"));
				break;

			default:
				ret =_FAIL;
				break;
			}

			ret = MPwlanhdr_to_ethhdr (rframe);

			if (ret != _SUCCESS)
			{
				RT_TRACE(_module_rtl871x_recv_c_,_drv_err_,("wlanhdr_to_ethhdr: drop pkt \n"));
				#ifdef DBG_RX_DROP_FRAME
					DBG_871X("DBG_RX_DROP_FRAME %s wlanhdr_to_ethhdr: drop pkt\n", __FUNCTION__);
				#endif
					rtw_free_recvframe(rframe, pfree_recv_queue);//free this recv_frame
					ret = _FAIL;
					goto exit;
				}
				if ((padapter->bDriverStopped == _FALSE) && (padapter->bSurpriseRemoved == _FALSE))
				{
					RT_TRACE(_module_rtl871x_recv_c_, _drv_alert_, ("@@@@ recv_func: recv_func rtw_recv_indicatepkt\n" ));
							//indicate this recv_frame
					ret = rtw_recv_indicatepkt(padapter, rframe);
					if (ret != _SUCCESS)
					{
					#ifdef DBG_RX_DROP_FRAME
								DBG_871X("DBG_RX_DROP_FRAME %s rtw_recv_indicatepkt fail!\n", __FUNCTION__);
					#endif
								rtw_free_recvframe(rframe, pfree_recv_queue);//free this recv_frame
								ret = _FAIL;

								goto exit;
					}
				}
				else
				{
					RT_TRACE(_module_rtl871x_recv_c_, _drv_alert_, ("@@@@  recv_func: rtw_free_recvframe\n" ));
					RT_TRACE(_module_rtl871x_recv_c_, _drv_debug_, ("recv_func:bDriverStopped(%d) OR bSurpriseRemoved(%d)", padapter->bDriverStopped, padapter->bSurpriseRemoved));
					#ifdef DBG_RX_DROP_FRAME
						DBG_871X("DBG_RX_DROP_FRAME %s ecv_func:bDriverStopped(%d) OR bSurpriseRemoved(%d)\n", __FUNCTION__,
									padapter->bDriverStopped, padapter->bSurpriseRemoved);
					#endif
					ret = _FAIL;
					rtw_free_recvframe(rframe, pfree_recv_queue);//free this recv_frame
						goto exit;
				}

			}
		}

	}

	RT_TRACE(_module_rtl871x_recv_c_, _drv_info_, ("recv_func: validate_recv_frame fail! drop pkt\n"));
	rtw_free_recvframe(rframe, pfree_recv_queue);//free this recv_frame
	ret = _FAIL;

exit:
		return ret;

}

static sint fill_radiotap_hdr(_adapter *padapter, union recv_frame *precvframe, u8 *buf)
{
#define CHAN2FREQ(a) ((a < 14)?(2407+5*a):(5000+5*a))

#if 0
#define RTW_RX_RADIOTAP_PRESENT (                 \
		(1 << IEEE80211_RADIOTAP_TSFT)              | \
		(1 << IEEE80211_RADIOTAP_FLAGS)             | \
		(1 << IEEE80211_RADIOTAP_RATE)              | \
		(1 << IEEE80211_RADIOTAP_CHANNEL)           | \
		(0 << IEEE80211_RADIOTAP_FHSS)              | \
		(1 << IEEE80211_RADIOTAP_DBM_ANTSIGNAL)     | \
		(1 << IEEE80211_RADIOTAP_DBM_ANTNOISE)      | \
		(0 << IEEE80211_RADIOTAP_LOCK_QUALITY)      | \
		(0 << IEEE80211_RADIOTAP_TX_ATTENUATION)    | \
		(0 << IEEE80211_RADIOTAP_DB_TX_ATTENUATION) | \
		(0 << IEEE80211_RADIOTAP_DBM_TX_POWER)      | \
		(1 << IEEE80211_RADIOTAP_ANTENNA)           | \
		(1 << IEEE80211_RADIOTAP_DB_ANTSIGNAL)      | \
		(0 << IEEE80211_RADIOTAP_DB_ANTNOISE)       | \
		(0 << IEEE80211_RADIOTAP_RX_FLAGS)          | \
		(0 << IEEE80211_RADIOTAP_TX_FLAGS)          | \
		(0 << IEEE80211_RADIOTAP_RTS_RETRIES)       | \
		(0 << IEEE80211_RADIOTAP_DATA_RETRIES)      | \
		(0 << IEEE80211_RADIOTAP_MCS)               | \
		(0 << IEEE80211_RADIOTAP_RADIOTAP_NAMESPACE)| \
		(0 << IEEE80211_RADIOTAP_VENDOR_NAMESPACE)  | \
		(0 << IEEE80211_RADIOTAP_EXT)               | \
		0)

	/* (0 << IEEE80211_RADIOTAP_AMPDU_STATUS)      | \ */
	/* (0 << IEEE80211_RADIOTAP_VHT)               | \ */
#endif
#ifndef IEEE80211_RADIOTAP_MCS
#define IEEE80211_RADIOTAP_MCS 19
#endif
#ifndef IEEE80211_RADIOTAP_VHT
#define IEEE80211_RADIOTAP_VHT 21
#endif

#ifndef IEEE80211_RADIOTAP_F_BADFCS
#define IEEE80211_RADIOTAP_F_BADFCS 0x40 /* bad FCS */
#endif

	sint ret = _SUCCESS;
	_adapter			*adapter = precvframe->u.hdr.adapter;
	struct mlme_priv	*pmlmepriv = &adapter->mlmepriv;
	struct rx_pkt_attrib *pattrib = &precvframe->u.hdr.attrib;

	HAL_DATA_TYPE *pHalData = GET_HAL_DATA(padapter);

	u16 tmp_16bit = 0;

	u8 data_rate[] = {
		2, 4, 11, 22, /* CCK */
		12, 18, 24, 36, 48, 72, 93, 108, /* OFDM */
		0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, /* HT MCS index */
		16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31,
		0, 1, 2, 3, 4, 5, 6, 7, 8, 9, /* VHT Nss 1 */
		0, 1, 2, 3, 4, 5, 6, 7, 8, 9, /* VHT Nss 2 */
		0, 1, 2, 3, 4, 5, 6, 7, 8, 9, /* VHT Nss 3 */
		0, 1, 2, 3, 4, 5, 6, 7, 8, 9, /* VHT Nss 4 */
	};

